Omar-Magdy0/ForgeDrive/fdlib/driver/stm32f4/fd_mc3p.c
    //GET TIMER MAX MAX VALUE TO BE USED FOR DUTY CALCULATION
    h->timer_max_q15 = LL_TIM_GetAutoReload(TIM1);
    // Finally enable the timer (Configuration done)
    LL_TIM_EnableAllOutputs(TIM1);
    LL_TIM_EnableCounter(TIM1);
}


void fd_mc3p_init(fd_mc3p_handle_t *h)
{
    mc3p_gpio_init();
    mc3p_tim1_init(h);
    h->duty_max_q15 = (uint16_t)((h->config.duty_max) * 0x7FFF);
    h->duty_min_q15 = (uint16_t)((h->config.duty_min) * 0x7FFF);
    //compute deadtme compensation
    #ifdef FD_MC3P_DTC_ACTIVE
    h->dtc_comp_q15 = (uint16_t)(((float)h->config.deadtime_nS*h->config.pwm_Hz/1e9)*INT16_MAX + 0.5);
    #endif
    mc3p_adc_init(h);
    mc3p_dma_init();
    h->sector_last = FD_MC3P_SECTOR_FLOAT;
    h->mode        = FD_MC3P_MODE_NONE;
    mc3p_irq_bind(h);
    mc3p_interrupt_init();
    if(h->offset_calibration)mc3p_offset_calibration(h);
    fd_mc3p_write_float(h);
}
void fd_mc3p_reconfigure_pwm(fd_mc3p_handle_t *h)
{
    LL_TIM_SetAutoReload(TIM1, __LL_TIM_CALC_ARR(HAL_RCC_GetPCLK2Freq(), 1, h->config.pwm_Hz));
    LL_TIM_OC_SetDeadTime(TIM1, (uint8_t)(__LL_TIM_CALC_DEADTIME(HAL_RCC_GetPCLK2Freq(), LL_TIM_GetClockDivision(TIM1), h->config.deadtime_nS)));
    //GET TIMER MAX MAX VALUE TO BE USED FOR DUTY CALCULATION
    h->timer_max_q15 = LL_TIM_GetAutoReload(TIM1);
    h->duty_max_q15 = (uint16_t)((h->config.duty_max) * 0x7FFF);
    h->duty_min_q15 = (uint16_t)((h->config.duty_min) * 0x7FFF);
    //compute deadtme compensation
    #ifdef FD_MC3P_DTC_ACTIVE
    h->dtc_comp_q15 = (uint16_t)(((float)h->config.deadtime_nS*h->config.pwm_Hz/1e9)*INT16_MAX + 0.5);
    #endif
}
//======================================================
// Phase Ouptut functions
//======================================================
void fd_mc3p_write_phase_state(fd_mc3p_handle_t *h, fd_mc3p_phase_state_t state_u, fd_mc3p_phase_state_t state_v, fd_mc3p_phase_state_t state_w)
{
    uint32_t ccer_shadow = TIM1->CCER;
    uint32_t ccmr1_shadow = TIM1->CCMR1;
    uint32_t ccmr2_shadow = TIM1->CCMR2;
    ccer_shadow |= (CC1E_MASK | CC2E_MASK | CC3E_MASK | CC1NE_MASK | CC2NE_MASK | CC3NE_MASK);  // Set all OCxNE & OCxE bits
    ccmr1_shadow &= ~(OC1M_MASK | OC2M_MASK);  // Clear OC1M bits & OC2M bits
    ccmr2_shadow &= ~OC3M_MASK;  // Clear OC3M bits

    //Operations to be done here
    switch(state_u)
    {
        case(FD_MC3P_PHASE_FLOAT)  :   {ccmr1_shadow |= OC1M_INACTIVE; ccer_shadow  &= ~(CC1E_MASK); break;}
        case(FD_MC3P_PHASE_L_ON)   :   {ccmr1_shadow |= OC1M_INACTIVE; break;}
        case(FD_MC3P_PHASE_H_ON)   :   {ccmr1_shadow |= OC1M_ACTIVE;   break;}
        case(FD_MC3P_PHASE_COMP)   :   {ccmr1_shadow |= OC1M_PWM;      break;}
        case(FD_MC3P_PHASE_L_PWM)  :   {ccmr1_shadow |= OC1M_PWM   ; ccer_shadow &=  ~(CC1E_MASK); break;}
        case(FD_MC3P_PHASE_H_PWM)  :   {ccmr1_shadow |= OC1M_PWM   ; ccer_shadow &=  ~(CC1NE_MASK); break;}
    }
    switch(state_v)
    {        
        case(FD_MC3P_PHASE_FLOAT)  :   {ccmr1_shadow |= OC2M_INACTIVE; ccer_shadow  &= ~(CC2E_MASK); break;}
        case(FD_MC3P_PHASE_L_ON)   :   {ccmr1_shadow |= OC2M_INACTIVE; break;}
        case(FD_MC3P_PHASE_H_ON)   :   {ccmr1_shadow |= OC2M_ACTIVE;   break;}
        case(FD_MC3P_PHASE_COMP)   :   {ccmr1_shadow |= OC2M_PWM;      break;}
        case(FD_MC3P_PHASE_L_PWM)  :   {ccmr1_shadow |= OC2M_PWM   ; ccer_shadow &=  ~(CC2E_MASK); break;}
        case(FD_MC3P_PHASE_H_PWM)  :   {ccmr1_shadow |= OC2M_PWM   ; ccer_shadow &=  ~(CC2NE_MASK); break;}
    }
    switch(state_w)
    {
        case(FD_MC3P_PHASE_FLOAT)  :   {ccmr2_shadow |= OC3M_INACTIVE; ccer_shadow  &= ~(CC3E_MASK); break;}
        case(FD_MC3P_PHASE_L_ON)   :   {ccmr2_shadow |= OC3M_INACTIVE; break;}
        case(FD_MC3P_PHASE_H_ON)   :   {ccmr2_shadow |= OC3M_ACTIVE;   break;}
        case(FD_MC3P_PHASE_COMP)   :   {ccmr2_shadow |= OC3M_PWM;      break;}
        case(FD_MC3P_PHASE_L_PWM)  :   {ccmr2_shadow |= OC3M_PWM   ; ccer_shadow &=  ~(CC3E_MASK); break;}
        case(FD_MC3P_PHASE_H_PWM)  :   {ccmr2_shadow |= OC3M_PWM   ; ccer_shadow &=  ~(CC3NE_MASK); break;}
    }

    TIM1->CCER = ccer_shadow;
    TIM1->CCMR1 = ccmr1_shadow;
    TIM1->CCMR2 = ccmr2_shadow;
    TIM1->EGR |= TIM_EGR_COMG;
}

void fd_mc3p_write_phase_duty(fd_mc3p_handle_t *h, int16_t dutyu_q15, int16_t dutyv_q15, int16_t dutyw_q15)
{
    uint32_t compare_u = ((uint32_t)SATURATE(dutyu_q15, h->duty_min_q15, h->duty_max_q15) * h->timer_max_q15) >> 15;
    uint32_t compare_v = ((uint32_t)SATURATE(dutyv_q15, h->duty_min_q15, h->duty_max_q15) * h->timer_max_q15) >> 15;
    uint32_t compare_w = ((uint32_t)SATURATE(dutyw_q15, h->duty_min_q15, h->duty_max_q15) * h->timer_max_q15) >> 15;
    TIM1->CCR1 = compare_u;
    TIM1->CCR2 = compare_v;
    TIM1->CCR3 = compare_w;
}

void fd_mc3p_write_float(fd_mc3p_handle_t *h)
{    
    fd_mc3p_write_phase_state(h, FD_MC3P_PHASE_FLOAT, FD_MC3P_PHASE_FLOAT, FD_MC3P_PHASE_FLOAT);
    fd_mc3p_write_phase_duty(h, 0, 0, 0);
    h->sector_last = FD_MC3P_SECTOR_FLOAT;
}



typedef struct {
    fd_mc3p_phase_state_t phase_state[3]; // A,B,C: COMP, L_ON, FLOAT
} mc3p_trap_sector_map_t;


static const mc3p_trap_sector_map_t trap_table[6] = {
    [FD_MC3P_SECTOR_TRAP1 - 1] = { {FD_MC3P_PHASE_COMP, FD_MC3P_PHASE_L_ON, FD_MC3P_PHASE_FLOAT}},
    [FD_MC3P_SECTOR_TRAP2 - 1] = { {FD_MC3P_PHASE_COMP, FD_MC3P_PHASE_FLOAT, FD_MC3P_PHASE_L_ON}},
    [FD_MC3P_SECTOR_TRAP3 - 1] = { {FD_MC3P_PHASE_FLOAT, FD_MC3P_PHASE_COMP, FD_MC3P_PHASE_L_ON}},
    [FD_MC3P_SECTOR_TRAP4 - 1] = { {FD_MC3P_PHASE_L_ON, FD_MC3P_PHASE_COMP, FD_MC3P_PHASE_FLOAT}},
    [FD_MC3P_SECTOR_TRAP5 - 1] = { {FD_MC3P_PHASE_L_ON, FD_MC3P_PHASE_FLOAT, FD_MC3P_PHASE_COMP}},
    [FD_MC3P_SECTOR_TRAP6 - 1] = { {FD_MC3P_PHASE_FLOAT, FD_MC3P_PHASE_L_ON, FD_MC3P_PHASE_COMP}},
};

void fd_mc3p_write_trap(fd_mc3p_handle_t *h, fd_mc3p_sector_t sector, uint16_t duty_q15)
{
    if(!IS_TRAP_SECTOR(h->sector_last))
    {
        mc3p_adc_mode(h, sector);
        h->mode        = FD_MC3P_MODE_TRAP;
    }
 

    if(sector < FD_MC3P_SECTOR_TRAP1 || sector > FD_MC3P_SECTOR_TRAP6)
        return;

