Omar-Magdy0/ForgeDrive/fdlib/driver/stm32f4/fd_mc3p.c
    const mc3p_trap_sector_map_t *map = &trap_table[sector - 1];

    // Only update phase state & ADC if sector changed
    if(h->sector_last != sector)
    {
        fd_mc3p_write_phase_state(h, map->phase_state[0], map->phase_state[1], map->phase_state[2]);
        mc3p_adc_trap_update(h, sector);
        h->sector_last = sector;
    }
    #ifdef FD_MC3P_DTC_ACTIVE
    h->dutyu_q15 = __SSAT((int32_t)duty_q15 + ((h->dtc_state & (1<<3))? h->dtc_comp_q15 : -h->dtc_comp_q15), 16);
    h->dutyv_q15 = h->dutyu_q15;
    h->dutyw_q15 = h->dutyu_q15;
    #else
    h->dutyu_q15 = duty_q15;
    h->dutyv_q15 = h->dutyu_q15;
    h->dutyw_q15 = h->dutyu_q15;
    #endif
    fd_mc3p_write_phase_duty(h, h->dutyu_q15, h->dutyv_q15, h->dutyw_q15);
}

void fd_mc3p_write_svm(fd_mc3p_handle_t *h, int16_t alpha_q15, int16_t beta_q15) 
{
    int32_t vmax, vmin, voff;
    if(!IS_SVM_SECTOR(h->sector_last))
    {
        fd_mc3p_write_phase_state(h, FD_MC3P_PHASE_COMP, FD_MC3P_PHASE_COMP, FD_MC3P_PHASE_COMP);
        h->mode        = FD_MC3P_MODE_SVM;
    }
    int32_t dutyu_q15, dutyv_q15, dutyw_q15;
    /* αβ → phase (normalized Q15) */
    dutyu_q15 = alpha_q15;

    dutyv_q15 = (-(int32_t)Q15_HALF * alpha_q15
         + (int32_t)Q15_SQRT3_BY_2 * beta_q15) >> 15;

    dutyw_q15 = (-(int32_t)Q15_HALF * alpha_q15
         - (int32_t)Q15_SQRT3_BY_2 * beta_q15) >> 15;
    /* SVPWM zero-sequence injection */
    uint8_t b0 = (dutyu_q15 >= 0);
    uint8_t b1 = (dutyv_q15 >= 0);
    uint8_t b2 = (dutyw_q15 >= 0);

    // 3-bit code
    uint8_t code = (b2 << 2) | (b1 << 1) | b0;
    fd_mc3p_sector_t sector;
    switch(code)
    {
        case 0b001: sector = FD_MC3P_SECTOR_SVM1; break;
        case 0b011: sector = FD_MC3P_SECTOR_SVM2; break;
        case 0b010: sector = FD_MC3P_SECTOR_SVM3; break;
        case 0b110: sector = FD_MC3P_SECTOR_SVM4; break;
        case 0b100: sector = FD_MC3P_SECTOR_SVM5; break;
        case 0b101: sector = FD_MC3P_SECTOR_SVM6; break;
        default: sector = FD_MC3P_SECTOR_FLOAT; break; // should not happen
    }
    /* SVPWM zero-sequence injection */
    vmax = dutyu_q15;
    if (dutyv_q15 > vmax) vmax = dutyv_q15;
    if (dutyw_q15 > vmax) vmax = dutyw_q15;

    vmin = dutyu_q15;
    if (dutyv_q15 < vmin) vmin = dutyv_q15;
    if (dutyw_q15 < vmin) vmin = dutyw_q15;

    voff = (vmax + vmin) >> 1;

    dutyu_q15 = (dutyu_q15 - voff) + Q15_HALF;
    dutyv_q15 = (dutyv_q15 - voff) + Q15_HALF;
    dutyw_q15 = (dutyw_q15 - voff) + Q15_HALF;
    #ifdef FD_MC3P_DTC_ACTIVE
    h->dutyu_q15 = __SSAT(dutyu_q15 + ((h->dtc_state & (1<<0))? h->dtc_comp_q15 : -h->dtc_comp_q15), 16);
    h->dutyv_q15 = __SSAT(dutyv_q15 + ((h->dtc_state & (1<<1))? h->dtc_comp_q15 : -h->dtc_comp_q15), 16);
    h->dutyw_q15 = __SSAT(dutyw_q15 + ((h->dtc_state & (1<<2))? h->dtc_comp_q15 : -h->dtc_comp_q15), 16);
    #else
    h->dutyu_q15 = dutyu_q15;
    h->dutyv_q15 = dutyv_q15;
    h->dutyw_q15 = dutyw_q15;
    #endif
    fd_mc3p_write_phase_duty(h, h->dutyu_q15, h->dutyv_q15, h->dutyw_q15);
    h->sector_last = sector;
}

//==============================================
// Analog Reading functions
//==============================================
void mc3p_adc_mode(fd_mc3p_handle_t *h, fd_mc3p_sector_t sector)
{
    uint8_t is_svm = IS_SVM_SECTOR(sector);
    uint8_t is_trap = IS_TRAP_SECTOR(sector);
    if(is_svm)
    {
        LL_ADC_INJ_SetSequencerLength(ADC1, LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_1, FD_MC3P_VSBUS_ADC_CHANNEL);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_2, FD_MC3P_CSU_ADC_CHANNEL);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_3, FD_MC3P_CSV_ADC_CHANNEL);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_4, FD_MC3P_CSW_ADC_CHANNEL);
        h->sync_rank_scale[0] = FD_MC3P_VSBUS;
        h->sync_rank_scale[1] = FD_MC3P_CSU;
        h->sync_rank_scale[2] = FD_MC3P_CSV;
        h->sync_rank_scale[3] = FD_MC3P_CSW;
    }else if(is_trap)
    {
        LL_ADC_INJ_SetSequencerLength(ADC1, LL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS);
        LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_1, FD_MC3P_VSBUS_ADC_CHANNEL);
        h->sync_rank_scale[0] = FD_MC3P_VSBUS;
    }
}

void mc3p_adc_svm_update(fd_mc3p_handle_t *h, fd_mc3p_sector_t sector)
{
    
}

typedef struct {
    uint32_t rank2_channel;
    uint32_t rank3_channel;
    uint8_t  rank2_scale_idx;
    uint8_t  rank3_scale_idx;
} mc3p_adc_map_t;

static const mc3p_adc_map_t adc_trap_table[6] = {
    [FD_MC3P_SECTOR_TRAP1 - 1] = { FD_MC3P_VSW_ADC_CHANNEL, FD_MC3P_CSV_ADC_CHANNEL, FD_MC3P_VSW, FD_MC3P_CSV},
    [FD_MC3P_SECTOR_TRAP2 - 1] = { FD_MC3P_VSV_ADC_CHANNEL, FD_MC3P_CSW_ADC_CHANNEL, FD_MC3P_VSV, FD_MC3P_CSW},
    [FD_MC3P_SECTOR_TRAP3 - 1] = { FD_MC3P_VSU_ADC_CHANNEL, FD_MC3P_CSW_ADC_CHANNEL, FD_MC3P_VSU, FD_MC3P_CSW},
    [FD_MC3P_SECTOR_TRAP4 - 1] = { FD_MC3P_VSW_ADC_CHANNEL, FD_MC3P_CSU_ADC_CHANNEL, FD_MC3P_VSW, FD_MC3P_CSU},
    [FD_MC3P_SECTOR_TRAP5 - 1] = { FD_MC3P_VSV_ADC_CHANNEL, FD_MC3P_CSU_ADC_CHANNEL, FD_MC3P_VSV, FD_MC3P_CSU},
    [FD_MC3P_SECTOR_TRAP6 - 1] = { FD_MC3P_VSU_ADC_CHANNEL, FD_MC3P_CSV_ADC_CHANNEL, FD_MC3P_VSU, FD_MC3P_CSV},
};

void mc3p_adc_trap_update(fd_mc3p_handle_t *h, fd_mc3p_sector_t sector)
{
    const mc3p_adc_map_t *map = &adc_trap_table[sector - 1];
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_2, map->rank2_channel);
    LL_ADC_INJ_SetSequencerRanks(ADC1, LL_ADC_INJ_RANK_3, map->rank3_channel);
}

#include <string.h>
void fd_mc3p_read_sync(fd_mc3p_handle_t *h, void *data)
{
#define DTC_UPDATE_POLARITY(current, bit)         \
    do                                            \
    {                                             \
        if ((current) > (int32_t)FD_MC3P_DTC_CTHRESH)       \
        {                                         \
            h->dtc_state |= (bit);             \
        }                                         \
        else if ((current) < -(int32_t)FD_MC3P_DTC_CTHRESH) \
        {                                         \
            h->dtc_state &= ~(bit);            \
        }                                         \
    } while (0)

    uint8_t is_svm = IS_SVM_SECTOR(h->sector_last);
    uint8_t is_trap = IS_TRAP_SECTOR(h->sector_last);
    if (is_svm)
    {
        ((fd_mc3p_trap_data_t *)(data))->vbus_q31 = (h->sync_scale_q31[h->sync_rank_scale[0]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[0]][1]);
        ((fd_mc3p_svm_data_t *)(data))->cu_q31 = (h->sync_scale_q31[h->sync_rank_scale[1]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[1]][1]);
        ((fd_mc3p_svm_data_t *)(data))->cv_q31 = (h->sync_scale_q31[h->sync_rank_scale[2]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_2)) + h->sync_scale_q31[h->sync_rank_scale[2]][1]);
        ((fd_mc3p_svm_data_t *)(data))->cw_q31 = (h->sync_scale_q31[h->sync_rank_scale[3]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_3)) + h->sync_scale_q31[h->sync_rank_scale[3]][1]);
        // Dead-time compensation
        #ifdef FD_MC3P_DTC_ACTIVE
        DTC_UPDATE_POLARITY(((fd_mc3p_svm_data_t *)(data))->cu_q31, (1 << 0));
        DTC_UPDATE_POLARITY(((fd_mc3p_svm_data_t *)(data))->cv_q31, (1 << 1));
        DTC_UPDATE_POLARITY(((fd_mc3p_svm_data_t *)(data))->cw_q31, (1 << 2));
        #endif
    }
    else if (is_trap)
    {
        ((fd_mc3p_trap_data_t *)(data))->vbus_q31 = (h->sync_scale_q31[h->sync_rank_scale[0]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[0]][1]);
        ((fd_mc3p_trap_data_t *)(data))->vbemf_q31 = (h->sync_scale_q31[h->sync_rank_scale[1]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_2)) + h->sync_scale_q31[h->sync_rank_scale[1]][1]);
        ((fd_mc3p_trap_data_t *)(data))->cbus_q31 = (h->sync_scale_q31[h->sync_rank_scale[2]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_3)) + h->sync_scale_q31[h->sync_rank_scale[2]][1]);
        #ifdef FD_MC3P_DTC_ACTIVE
        DTC_UPDATE_POLARITY(((fd_mc3p_trap_data_t *)(data))->cbus_q31 , (1 << 3));
        #endif
    }
    else
    {
        ((fd_mc3p_trap_data_t *)(data))->vbus_q31 = (h->sync_scale_q31[h->sync_rank_scale[0]][0] * (LL_ADC_INJ_ReadConversionData12(ADC1, LL_ADC_INJ_RANK_1)) + h->sync_scale_q31[h->sync_rank_scale[0]][1]);
    }
}

uint8_t fd_mc3p_read_bg(fd_mc3p_handle_t *h, float* scanData)
{
    uint8_t readBuffer = 1 - mc3p_bg_active_buffer; // Always read from inactive buffer
    for(int i = 0; i < FD_MC3P_BG_CHANNELS; i++)
    {
        mc3p_bg_data_V[i] = (h->adc_to_uV * (mc3p_bg_data[readBuffer][i]) ) / 1000000.0;
    }
    memcpy(scanData, mc3p_bg_data_V, FD_MC3P_BG_CHANNELS * sizeof(float));
    isReady = 0;
    return FD_MC3P_BG_CHANNELS;
}


void fd_mc3p_bg_startConv(fd_mc3p_handle_t *h)
{
    isReady = 0;
    LL_ADC_REG_StartConversionSWStart(ADC1);
}

uint8_t fd_mc3p_bg_channels(fd_mc3p_handle_t *h)
{
    return FD_MC3P_BG_CHANNELS;
}

uint8_t fd_mc3p_bg_isReady(fd_mc3p_handle_t *h)
{
    return isReady;
}


void DMA2_Stream0_IRQHandler(void)
{
    if (LL_DMA_IsActiveFlag_HT0(MC3P_DMA_INSTANCE)) {
        LL_DMA_ClearFlag_HT0(MC3P_DMA_INSTANCE);
        // Half transfer complete - First Half samples Done
        mc3p_bg_active_buffer = 1;
        isReady = 1;
    }
    
    if (LL_DMA_IsActiveFlag_TC0(MC3P_DMA_INSTANCE)) {
        LL_DMA_ClearFlag_TC0(MC3P_DMA_INSTANCE);
        // Full transfer complete - Second Half Samples Done
        mc3p_bg_active_buffer = 0;
        isReady = 1;
    }
}

